n = int(input())
scores = list(map(int, input().split()))

# Реализуйте поиск второго максимума

print("Замените эту строку на второй максимум из списка")